# Задача 8: Требуется определить, можно ли от шоколадки размером
# n × m долек отломить k долек, если разрешается сделать один разлом по прямой
# между дольками (то есть разломить шоколадку на два прямоугольника).
# *Пример:*
# 3 2 4 -> yes
# 3 2 1 -> no
m = int(input('Длина шоколадки в долях: '))
n = int(input('Ширина шоколадки в долях: '))
k = int(input('Сколько долек хотите отломить: '))
if (k % m == 0 or k % n == 0) and (k < m*n and k != m*n and k != 0):
    print(f'{k} кусочков отломить можно!')
else:
    print(f'{k} кусочков отломить нельзя!')
